In [1]:
import pandas as pd

In [2]:
# The data source is from Malaysia DOSM (https://data.gov.my/data-catalogue/births)
URL_DATA = 'https://storage.data.gov.my/demography/births.parquet'

# Extract data from source
df = pd.read_parquet("https://storage.data.gov.my/demography/births.parquet")

print(df.head())

         date     state  births
0  1920-01-01  Malaysia      96
1  1920-01-02  Malaysia     115
2  1920-01-03  Malaysia     111
3  1920-01-04  Malaysia     101
4  1920-01-05  Malaysia      95

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 37833 entries, 0 to 37832
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    37833 non-null  object
 1   state   37833 non-null  object
 2   births  37833 non-null  int64
dtypes: int64(1), object(2)
memory usage: 886.8+ KB

In [4]:
df.shape

(37833, 3)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 37833 entries, 0 to 37832
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    37833 non-null  object
 1   state   37833 non-null  object
 2   births  37833 non-null  int64
dtypes: int64(1), object(2)
memory usage: 886.8+ KB

In [7]:
# Task 1: Based on the lesson learned previously, convert the "DATE" column data type into datetime format
df["date"] = pd.to_datetime(df["date"],
                                  format= '%m/%d/%Y %I:%M:%S %p')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 37833 entries, 0 to 37832
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    37833 non-null  datetime64[ns]
 1   state   37833 non-null  object
 2   births  37833 non-null  int64
dtypes: datetime64[ns](1), int64(1), object(1)
memory usage: 886.8+ KB

In [9]:
df.head(3)

        date     state  births
0 1920-01-01  Malaysia      96
1 1920-01-02  Malaysia     115
2 1920-01-03  Malaysia     111

In [21]:
# Task 2a: Extract the Month name (e.g. January/February/March etc) into another column called "MONTH_NAME"
# Then get average of births aggregate/group by MONTH_NAME
# The expected dataframe is something like this:

# |----------------|-----------|
# |MONTH_NAME      | AVG_BIRTH |
# |----------------|-----------|
# |JANUARY XXX     |           |
# |FEBRUARY XXX    |           |
# |MARCH XXX       |           |
#   .....           

...
df['MONTH_NAME2'] = df['date'].dt.month_name()
df['YEAR_NAME2'] = df['date'].dt.year
df.sample(3)

,date,state,births,MONTH_NAME,YEAR_NAME,MONTH_NAME2,YEAR_NAME2
25226,1989-01-24,Malaysia,1265,January,1989,January,1989
20510,1976-02-26,Malaysia,997,February,1976,February,1976
7697,1941-01-27,Malaysia,321,January,1941,January,1941

In [32]:
# AGGREGATE
MONTH_NAME3 = df\
                     .groupby( ['MONTH_NAME']  ) \
                     .agg(
                         AVG_BIRTH = ('births', 'mean'),
                         )\
                     .reset_index()
    
MONTH_NAME3

   MONTH_NAME   AVG_BIRTH
0       April  945.387500
1      August  951.493893
2    December  951.100846
3    February  904.976515
4     January  928.116935
5        July  946.085608
6        June  960.348718
7       March  926.428970
8         May  959.320099
9    November  963.218123
10    October  985.878171
11  September  981.742071

In [33]:
# Task 2b: Save the aggregated dataframe in task 2a above into CSV file without index (index=False) in the same folder as this file
# The filename shall be your nickname + _avg_birth_by_month.csv
# Example: azhar_avg_birth_by_month.csv
# No space is allowed. But make sure your nickname is recognizable for evaluation.

MONTH_NAME3.to_csv(r'C:\Users\ak0143\OneDrive\Kamal\TRAINING\DE 101\GitHub2-Branch\python-pandas\Kamal_avg_birth_by_month.csv', index=False)
# Best to use parquet

In [34]:
# Task 3a: Create a dataframe to calculate average birth by the following generation group:
# --> Silent Generation - from 1928 to 1945 included
# --> Baby Boomers - from 1946 to 1964 included
# --> Gen X - from 1965 to 1980 included
# --> Gen Y - from 1981 to 1996 included
# The expected dataframe is something like this:

# |----------------|-----------|
# |GENERATION      | AVG_BIRTH |
# |----------------|-----------|
# |Gen X           |           |
# |Gen Y           |           |
# ......

# Hint: Use for-loop and if/else

     YEAR_NAME    AVG_BIRTH
0         1920   106.010929
1         1921   116.468493
2         1922   105.115068
3         1923   164.986301
4         1924   209.871585
..         ...          ...
99        2019  1372.906849
100       2020  1327.043716
101       2021  1254.643836
102       2022  1199.205479
103       2023  1260.594340

[104 rows x 2 columns]

In [55]:
for i, x in enumerate(Gen_Agg['YEAR_NAME']):
    if x <= 1945:
        df.loc[i, 'Generation'] = 'Silent Gen'
    elif x <= 1964:
        df.loc[i, 'Generation'] = 'Boomers'
    elif x <= 1980:
        df.loc[i, 'Generation'] = 'Gen X'
    elif x <= 1996:
        df.loc[i,'Generation'] = 'Gen Y'
    else:
        df.loc[i,'Generation'] = 'OTHERS'

df.head(3)

,date,state,births,MONTH_NAME,YEAR_NAME,MONTH_NAME2,YEAR_NAME2,Generation
0,1920-01-01,Malaysia,96,January,1920,January,1920,Silent Gen
1,1920-01-02,Malaysia,115,January,1920,January,1920,Silent Gen
2,1920-01-03,Malaysia,111,January,1920,January,1920,Silent Gen

In [56]:
# AGGREGATE BY GENERATION
Gen_Agg = df\
                     .groupby( ['Generation']  ) \
                     .agg(
                         AVG_BIRTH = ('births', 'mean'),
                         )\
                     .reset_index()
    
Gen_Agg

   Generation   AVG_BIRTH
0     Boomers   90.894737
1       Gen X  100.375000
2       Gen Y   95.000000
3      OTHERS   93.111111
4  Silent Gen   94.076923

In [46]:
# for row in Gen_Agg.iterrows():
#     year_name = row[1]['YEAR_NAME']
#     avg_birth = row[1]['AVG_BIRTH']
    
#     if year_name <= 1945
#     elif year_name >=1946 and year_name <= 1964
#     elif year_name >=1965 and year_name <= 1980
#     elif year_name >=1981 and year_name <= 1996

#     # print(f"Year: {year_name}. Avg Birth {avg_birth}")
#     # print(row)
#     # print('----')

Year: 1920.0. Avg Birth 106.01092896174863
(0, YEAR_NAME    1920.000000
AVG_BIRTH     106.010929
Name: 0, dtype: float64)
----
Year: 1921.0. Avg Birth 116.46849315068494
(1, YEAR_NAME    1921.000000
AVG_BIRTH     116.468493
Name: 1, dtype: float64)
----
Year: 1922.0. Avg Birth 105.11506849315069
(2, YEAR_NAME    1922.000000
AVG_BIRTH     105.115068
Name: 2, dtype: float64)
----
Year: 1923.0. Avg Birth 164.986301369863
(3, YEAR_NAME    1923.000000
AVG_BIRTH     164.986301
Name: 3, dtype: float64)
----
Year: 1924.0. Avg Birth 209.87158469945356
(4, YEAR_NAME    1924.000000
AVG_BIRTH     209.871585
Name: 4, dtype: float64)
----
Year: 1925.0. Avg Birth 135.31506849315068
(5, YEAR_NAME    1925.000000
AVG_BIRTH     135.315068
Name: 5, dtype: float64)
----
Year: 1926.0. Avg Birth 154.07123287671232
(6, YEAR_NAME    1926.000000
AVG_BIRTH     154.071233
Name: 6, dtype: float64)
----
Year: 1927.0. Avg Birth 161.74794520547945
(7, YEAR_NAME    1927.000000
AVG_BIRTH     161.747945
Name: 7, dtype: float64)
----
Year: 1928.0. Avg Birth 215.49726775956285
(8, YEAR_NAME    1928.000000
AVG_BIRTH     215.497268
Name: 8, dtype: float64)
----
Year: 1929.0. Avg Birth 254.35616438356163
(9, YEAR_NAME    1929.000000
AVG_BIRTH     254.356164
Name: 9, dtype: float64)
----
Year: 1930.0. Avg Birth 222.75890410958905
(10, YEAR_NAME    1930.000000
AVG_BIRTH     222.758904
Name: 10, dtype: float64)
----
Year: 1931.0. Avg Birth 233.1041095890411
(11, YEAR_NAME    1931.00000
AVG_BIRTH     233.10411
Name: 11, dtype: float64)
----
Year: 1932.0. Avg Birth 213.7622950819672
(12, YEAR_NAME    1932.000000
AVG_BIRTH     213.762295
Name: 12, dtype: float64)
----
Year: 1933.0. Avg Birth 265.5671232876712
(13, YEAR_NAME    1933.000000
AVG_BIRTH     265.567123
Name: 13, dtype: float64)
----
Year: 1934.0. Avg Birth 282.14794520547946
(14, YEAR_NAME    1934.000000
AVG_BIRTH     282.147945
Name: 14, dtype: float64)
----
Year: 1935.0. Avg Birth 311.372602739726
(15, YEAR_NAME    1935.000000
AVG_BIRTH     311.372603
Name: 15, dtype: float64)
----
Year: 1936.0. Avg Birth 344.6174863387978
(16, YEAR_NAME    1936.000000
AVG_BIRTH     344.617486
Name: 16, dtype: float64)
----
Year: 1937.0. Avg Birth 328.0082191780822
(17, YEAR_NAME    1937.000000
AVG_BIRTH     328.008219
Name: 17, dtype: float64)
----
Year: 1938.0. Avg Birth 389.56986301369864
(18, YEAR_NAME    1938.000000
AVG_BIRTH     389.569863
Name: 18, dtype: float64)
----
Year: 1939.0. Avg Birth 380.63835616438354
(19, YEAR_NAME    1939.000000
AVG_BIRTH     380.638356
Name: 19, dtype: float64)
----
Year: 1940.0. Avg Birth 372.95628415300547
(20, YEAR_NAME    1940.000000
AVG_BIRTH     372.956284
Name: 20, dtype: float64)
----
Year: 1941.0. Avg Birth 385.13698630136986
(21, YEAR_NAME    1941.000000
AVG_BIRTH     385.136986
Name: 21, dtype: float64)
----
Year: 1942.0. Avg Birth 384.6575342465753
(22, YEAR_NAME    1942.000000
AVG_BIRTH     384.657534
Name: 22, dtype: float64)
----
Year: 1943.0. Avg Birth 410.3150684931507
(23, YEAR_NAME    1943.000000
AVG_BIRTH     410.315068
Name: 23, dtype: float64)
----
Year: 1944.0. Avg Birth 387.10382513661204
(24, YEAR_NAME    1944.000000
AVG_BIRTH     387.103825
Name: 24, dtype: float64)
----
Year: 1945.0. Avg Birth 374.3643835616438
(25, YEAR_NAME    1945.000000
AVG_BIRTH     374.364384
Name: 25, dtype: float64)
----
Year: 1946.0. Avg Birth 475.013698630137
(26, YEAR_NAME    1946.000000
AVG_BIRTH     475.013699
Name: 26, dtype: float64)
----
Year: 1947.0. Avg Birth 541.5041095890411
(27, YEAR_NAME    1947.00000
AVG_BIRTH     541.50411
Name: 27, dtype: float64)
----
Year: 1948.0. Avg Birth 524.672131147541
(28, YEAR_NAME    1948.000000
AVG_BIRTH     524.672131
Name: 28, dtype: float64)
----
Year: 1949.0. Avg Birth 578.7095890410959
(29, YEAR_NAME    1949.000000
AVG_BIRTH     578.709589
Name: 29, dtype: float64)
----
Year: 1950.0. Avg Birth 575.7287671232876
(30, YEAR_NAME    1950.000000
AVG_BIRTH     575.728767
Name: 30, dtype: float64)
----
Year: 1951.0. Avg Birth 622.4657534246576
(31, YEAR_NAME    1951.000000
AVG_BIRTH     622.465753
Name: 31, dtype: float64)
----
Year: 1952.0. Avg Birth 686.6065573770492
(32, YEAR_NAME    1952.000000
AVG_BIRTH     686.606557
Name: 32, dtype: float64)
----
Year: 1953.0. Avg Birth 706.0657534246575
(33, YEAR_NAME    1953.000000
AVG_BIRTH     706.065753
Name: 33, dtype: float64)
----
Year: 1954.0. Avg Birth 743.1534246575343
(34, YEAR_NAME    1954.000000
AVG_BIRTH     743.153425
Name: 34, dtype: float64)
----
Year: 1955.0. Avg Birth 785.358904109589
(35, YEAR_NAME    1955.000000
AVG_BIRTH     785.358904
Name: 35, dtype: float64)
----
Year: 1956.0. Avg Birth 849.0218579234972
(36, YEAR_NAME    1956.000000
AVG_BIRTH     849.021858
Name: 36, dtype: float64)
----
Year: 1957.0. Avg Birth 838.3808219178082
(37, YEAR_NAME    1957.000000
AVG_BIRTH     838.380822
Name: 37, dtype: float64)
----
Year: 1958.0. Avg Birth 886.2219178082191
(38, YEAR_NAME    1958.000000
AVG_BIRTH     886.221918
Name: 38, dtype: float64)
----
Year: 1959.0. Avg Birth 894.1917808219179
(39, YEAR_NAME    1959.000000
AVG_BIRTH     894.191781
Name: 39, dtype: float64)
----
Year: 1960.0. Avg Birth 922.3907103825137
(40, YEAR_NAME    1960.00000
AVG_BIRTH     922.39071
Name: 40, dtype: float64)
----
Year: 1961.0. Avg Birth 936.3150684931506
(41, YEAR_NAME    1961.000000
AVG_BIRTH     936.315068
Name: 41, dtype: float64)
----
Year: 1962.0. Avg Birth 954.1945205479452
(42, YEAR_NAME    1962.000000
AVG_BIRTH     954.194521
Name: 42, dtype: float64)
----
Year: 1963.0. Avg Birth 986.6356164383561
(43, YEAR_NAME    1963.000000
AVG_BIRTH     986.635616
Name: 43, dtype: float64)
----
Year: 1964.0. Avg Birth 1016.5765027322404
(44, YEAR_NAME    1964.000000
AVG_BIRTH    1016.576503
Name: 44, dtype: float64)
----
Year: 1965.0. Avg Birth 997.6356164383561
(45, YEAR_NAME    1965.000000
AVG_BIRTH     997.635616
Name: 45, dtype: float64)
----
Year: 1966.0. Avg Birth 1025.2739726027398
(46, YEAR_NAME    1966.000000
AVG_BIRTH    1025.273973
Name: 46, dtype: float64)
----
Year: 1967.0. Avg Birth 979.5342465753424
(47, YEAR_NAME    1967.000000
AVG_BIRTH     979.534247
Name: 47, dtype: float64)
----
Year: 1968.0. Avg Birth 1036.5792349726776
(48, YEAR_NAME    1968.000000
AVG_BIRTH    1036.579235
Name: 48, dtype: float64)
----
Year: 1969.0. Avg Birth 1008.9150684931507
(49, YEAR_NAME    1969.000000
AVG_BIRTH    1008.915068
Name: 49, dtype: float64)
----
Year: 1970.0. Avg Birth 1015.3726027397261
(50, YEAR_NAME    1970.000000
AVG_BIRTH    1015.372603
Name: 50, dtype: float64)
----
Year: 1971.0. Avg Birth 1030.468493150685
(51, YEAR_NAME    1971.000000
AVG_BIRTH    1030.468493
Name: 51, dtype: float64)
----
Year: 1972.0. Avg Birth 1041.0464480874316
(52, YEAR_NAME    1972.000000
AVG_BIRTH    1041.046448
Name: 52, dtype: float64)
----
Year: 1973.0. Avg Birth 1028.4493150684932
(53, YEAR_NAME    1973.000000
AVG_BIRTH    1028.449315
Name: 53, dtype: float64)
----
Year: 1974.0. Avg Birth 1043.0849315068492
(54, YEAR_NAME    1974.000000
AVG_BIRTH    1043.084932
Name: 54, dtype: float64)
----
Year: 1975.0. Avg Birth 1059.7369863013698
(55, YEAR_NAME    1975.000000
AVG_BIRTH    1059.736986
Name: 55, dtype: float64)
----
Year: 1976.0. Avg Birth 1106.6967213114754
(56, YEAR_NAME    1976.000000
AVG_BIRTH    1106.696721
Name: 56, dtype: float64)
----
Year: 1977.0. Avg Birth 1121.717808219178
(57, YEAR_NAME    1977.000000
AVG_BIRTH    1121.717808
Name: 57, dtype: float64)
----
Year: 1978.0. Avg Birth 1105.9506849315069
(58, YEAR_NAME    1978.000000
AVG_BIRTH    1105.950685
Name: 58, dtype: float64)
----
Year: 1979.0. Avg Birth 1145.0602739726028
(59, YEAR_NAME    1979.000000
AVG_BIRTH    1145.060274
Name: 59, dtype: float64)
----
Year: 1980.0. Avg Birth 1179.3360655737704
(60, YEAR_NAME    1980.000000
AVG_BIRTH    1179.336066
Name: 60, dtype: float64)
----
Year: 1981.0. Avg Birth 1232.5643835616438
(61, YEAR_NAME    1981.000000
AVG_BIRTH    1232.564384
Name: 61, dtype: float64)
----
Year: 1982.0. Avg Birth 1274.4739726027397
(62, YEAR_NAME    1982.000000
AVG_BIRTH    1274.473973
Name: 62, dtype: float64)
----
Year: 1983.0. Avg Birth 1271.704109589041
(63, YEAR_NAME    1983.00000
AVG_BIRTH    1271.70411
Name: 63, dtype: float64)
----
Year: 1984.0. Avg Birth 1330.0874316939892
(64, YEAR_NAME    1984.000000
AVG_BIRTH    1330.087432
Name: 64, dtype: float64)
----
Year: 1985.0. Avg Birth 1395.4301369863015
(65, YEAR_NAME    1985.000000
AVG_BIRTH    1395.430137
Name: 65, dtype: float64)
----
Year: 1986.0. Avg Birth 1463.3424657534247
(66, YEAR_NAME    1986.000000
AVG_BIRTH    1463.342466
Name: 66, dtype: float64)
----
Year: 1987.0. Avg Birth 1389.2739726027398
(67, YEAR_NAME    1987.000000
AVG_BIRTH    1389.273973
Name: 67, dtype: float64)
----
Year: 1988.0. Avg Birth 1444.1010928961748
(68, YEAR_NAME    1988.000000
AVG_BIRTH    1444.101093
Name: 68, dtype: float64)
----
Year: 1989.0. Avg Birth 1325.945205479452
(69, YEAR_NAME    1989.000000
AVG_BIRTH    1325.945205
Name: 69, dtype: float64)
----
Year: 1990.0. Avg Birth 1423.4246575342465
(70, YEAR_NAME    1990.000000
AVG_BIRTH    1423.424658
Name: 70, dtype: float64)
----
Year: 1991.0. Avg Birth 1437.5917808219178
(71, YEAR_NAME    1991.000000
AVG_BIRTH    1437.591781
Name: 71, dtype: float64)
----
Year: 1992.0. Avg Birth 1501.2704918032787
(72, YEAR_NAME    1992.000000
AVG_BIRTH    1501.270492
Name: 72, dtype: float64)
----
Year: 1993.0. Avg Birth 1522.3643835616438
(73, YEAR_NAME    1993.000000
AVG_BIRTH    1522.364384
Name: 73, dtype: float64)
----
Year: 1994.0. Avg Birth 1528.1808219178083
(74, YEAR_NAME    1994.000000
AVG_BIRTH    1528.180822
Name: 74, dtype: float64)
----
Year: 1995.0. Avg Birth 1592.4219178082192
(75, YEAR_NAME    1995.000000
AVG_BIRTH    1592.421918
Name: 75, dtype: float64)
----
Year: 1996.0. Avg Birth 1546.3469945355191
(76, YEAR_NAME    1996.000000
AVG_BIRTH    1546.346995
Name: 76, dtype: float64)
----
Year: 1997.0. Avg Birth 1549.2082191780821
(77, YEAR_NAME    1997.000000
AVG_BIRTH    1549.208219
Name: 77, dtype: float64)
----
Year: 1998.0. Avg Birth 1464.841095890411
(78, YEAR_NAME    1998.000000
AVG_BIRTH    1464.841096
Name: 78, dtype: float64)
----
Year: 1999.0. Avg Birth 1471.9506849315069
(79, YEAR_NAME    1999.000000
AVG_BIRTH    1471.950685
Name: 79, dtype: float64)
----
Year: 2000.0. Avg Birth 1533.4098360655737
(80, YEAR_NAME    2000.000000
AVG_BIRTH    1533.409836
Name: 80, dtype: float64)
----
Year: 2001.0. Avg Birth 1428.6082191780822
(81, YEAR_NAME    2001.000000
AVG_BIRTH    1428.608219
Name: 81, dtype: float64)
----
Year: 2002.0. Avg Birth 1409.5780821917808
(82, YEAR_NAME    2002.000000
AVG_BIRTH    1409.578082
Name: 82, dtype: float64)
----
Year: 2003.0. Avg Birth 1363.5972602739726
(83, YEAR_NAME    2003.00000
AVG_BIRTH    1363.59726
Name: 83, dtype: float64)
----
Year: 2004.0. Avg Birth 1366.2158469945355
(84, YEAR_NAME    2004.000000
AVG_BIRTH    1366.215847
Name: 84, dtype: float64)
----
Year: 2005.0. Avg Birth 1345.5780821917808
(85, YEAR_NAME    2005.000000
AVG_BIRTH    1345.578082
Name: 85, dtype: float64)
----
Year: 2006.0. Avg Birth 1346.5561643835617
(86, YEAR_NAME    2006.000000
AVG_BIRTH    1346.556164
Name: 86, dtype: float64)
----
Year: 2007.0. Avg Birth 1366.4191780821918
(87, YEAR_NAME    2007.000000
AVG_BIRTH    1366.419178
Name: 87, dtype: float64)
----
Year: 2008.0. Avg Birth 1400.0628415300546
(88, YEAR_NAME    2008.000000
AVG_BIRTH    1400.062842
Name: 88, dtype: float64)
----
Year: 2009.0. Avg Birth 1422.676712328767
(89, YEAR_NAME    2009.000000
AVG_BIRTH    1422.676712
Name: 89, dtype: float64)
----
Year: 2010.0. Avg Birth 1404.2438356164384
(90, YEAR_NAME    2010.000000
AVG_BIRTH    1404.243836
Name: 90, dtype: float64)
----
Year: 2011.0. Avg Birth 1457.2410958904109
(91, YEAR_NAME    2011.000000
AVG_BIRTH    1457.241096
Name: 91, dtype: float64)
----
Year: 2012.0. Avg Birth 1492.9398907103825
(92, YEAR_NAME    2012.000000
AVG_BIRTH    1492.939891
Name: 92, dtype: float64)
----
Year: 2013.0. Avg Birth 1448.6520547945206
(93, YEAR_NAME    2013.000000
AVG_BIRTH    1448.652055
Name: 93, dtype: float64)
----
Year: 2014.0. Avg Birth 1500.7205479452055
(94, YEAR_NAME    2014.000000
AVG_BIRTH    1500.720548
Name: 94, dtype: float64)
----
Year: 2015.0. Avg Birth 1473.8712328767124
(95, YEAR_NAME    2015.000000
AVG_BIRTH    1473.871233
Name: 95, dtype: float64)
----
Year: 2016.0. Avg Birth 1434.4590163934427
(96, YEAR_NAME    2016.000000
AVG_BIRTH    1434.459016
Name: 96, dtype: float64)
----
Year: 2017.0. Avg Birth 1437.1068493150685
(97, YEAR_NAME    2017.000000
AVG_BIRTH    1437.106849
Name: 97, dtype: float64)
----
Year: 2018.0. Avg Birth 1412.1205479452055
(98, YEAR_NAME    2018.000000
AVG_BIRTH    1412.120548
Name: 98, dtype: float64)
----
Year: 2019.0. Avg Birth 1372.9068493150685
(99, YEAR_NAME    2019.000000
AVG_BIRTH    1372.906849
Name: 99, dtype: float64)
----
Year: 2020.0. Avg Birth 1327.0437158469945
(100, YEAR_NAME    2020.000000
AVG_BIRTH    1327.043716
Name: 100, dtype: float64)
----
Year: 2021.0. Avg Birth 1254.6438356164383
(101, YEAR_NAME    2021.000000
AVG_BIRTH    1254.643836
Name: 101, dtype: float64)
----
Year: 2022.0. Avg Birth 1199.2054794520548
(102, YEAR_NAME    2022.000000
AVG_BIRTH    1199.205479
Name: 102, dtype: float64)
----
Year: 2023.0. Avg Birth 1260.5943396226414
(103, YEAR_NAME    2023.00000
AVG_BIRTH    1260.59434
Name: 103, dtype: float64)
----

In [57]:
# Task 3b: Save the aggregated dataframe in task 3a above into CSV file without index (index=False) in the same folder as this file
# The filename shall be your nickname + _avg_birth_by_generation.csv
# Example: azhar_avg_birth_by_generation.csv
# No space is allowed. But make sure your nickname is recognizable for evaluation.

Gen_Agg.to_csv(r'C:\Users\ak0143\OneDrive\Kamal\TRAINING\DE 101\GitHub2-Branch\python-pandas\Kamal_avg_birth_by_generation.csv', index=False)
# Best to use parquet